## Investigate Raw Data
### Author: S. Sakib Hasan
#### Date: March 20, 2020 @ 21:03 EDT

#### Set up environment

In [1]:
import os
import pandas as pd
import numpy as np

In [2]:
scripts_dir = os.getcwd();

In [3]:
os.chdir(os.path.join(scripts_dir, "..", "data"));

In [4]:
data_dir = os.getcwd();

In [6]:
rawFileName = "raw-data.xlsx";

In [7]:
df = pd.read_excel(rawFileName);

#### Get the shape of the data

In [9]:
df.shape

(3424, 20)

#### Get the column names

In [10]:
df.columns

Index(['First Name (Billing)', 'Last Name (Billing)', 'Company (Billing)',
       'Address 1&2 (Billing)', 'City (Billing)', 'State Code (Billing)',
       'Postcode (Billing)', 'Country Code (Billing)', 'Email (Billing)',
       'Phone (Billing)', 'First Name (Shipping)',
       'Summary Report Total Orders', 'Summary Report Total Items',
       'Summary Report Total Items (Exported)', 'Summary Report Total Amount',
       'Summary Report Total Amount Paid', 'Summary Report Total Shipping',
       'Summary Report Total Discount', 'Summary Report Total Refunds',
       'Summary Report Total Refund Amount'],
      dtype='object')

#### Describe the dataframe

In [11]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
First Name (Shipping),0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Summary Report Total Orders,3424.0,1.158586,0.809830,1.0,1.0,1.0,1.0,40.0
Summary Report Total Items,3424.0,1.682827,1.329188,0.0,1.0,1.0,2.0,21.0
Summary Report Total Items (Exported),3424.0,1.682827,1.329188,0.0,1.0,1.0,2.0,21.0
Summary Report Total Amount,3424.0,13.553446,10.597160,8.0,8.0,8.0,16.0,168.0
Summary Report Total Amount Paid,3424.0,10.504381,11.267106,0.0,0.0,8.0,16.0,120.0
Summary Report Total Shipping,3424.0,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0
Summary Report Total Discount,3424.0,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0
Summary Report Total Refunds,3424.0,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0
Summary Report Total Refund Amount,3424.0,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0

#### Get the number of null's in each column

In [16]:
df.isnull().sum()

First Name (Billing)                      926
Last Name (Billing)                      1154
Company (Billing)                        3247
Address 1&2 (Billing)                     926
City (Billing)                            926
State Code (Billing)                     1091
Postcode (Billing)                        934
Country Code (Billing)                    931
Email (Billing)                             1
Phone (Billing)                           928
First Name (Shipping)                    3424
Summary Report Total Orders                 0
Summary Report Total Items                  0
Summary Report Total Items (Exported)       0
Summary Report Total Amount                 0
Summary Report Total Amount Paid            0
Summary Report Total Shipping               0
Summary Report Total Discount               0
Summary Report Total Refunds                0
Summary Report Total Refund Amount          0
dtype: int64

In [17]:
df[df["Email (Billing)"].isna()]

,First Name (Billing),Last Name (Billing),Company (Billing),Address 1&2 (Billing),City (Billing),State Code (Billing),Postcode (Billing),Country Code (Billing),Email (Billing),Phone (Billing),First Name (Shipping),Summary Report Total Orders,Summary Report Total Items,Summary Report Total Items (Exported),Summary Report Total Amount,Summary Report Total Amount Paid,Summary Report Total Shipping,Summary Report Total Discount,Summary Report Total Refunds,Summary Report Total Refund Amount
350,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,40,3,3,24,0,0,0,0,0